{
    "articles": [
        {
            "id": 1,
            "component": "ArticleProfile",
            "locales": {},
            "settings": {
                "order_items_by": "id",
                "order_items_sort": "asc",
                "contact_list_ids": ["address", "email", "phone"],
                "contact_circles_ids": ["instagram", "facebook", "linkedin", "github"]
            },
            "items": [
                {
                    "id": 1,
                    "locales": {
                        "en": {
                            "description": "I've been a UX designer for 8 years, crafting user-friendly interfaces that feel natural, intuitive, and seamless across different devices. My passion lies in designing digital experiences that not only look great but also function effortlessly, making interactions smoother and more enjoyable."
                        },

                        "es": {
                            "description": "Llevo 8 años trabajando como diseñador UX, creando interfaces intuitivas, fluidas y fáciles de usar en distintos dispositivos. Me apasiona diseñar experiencias digitales que no solo sean atractivas, sino que también funcionen sin esfuerzo, haciendo que la interacción sea más fluida y agradable."
                        },

                        "fr": {
                            "description": "Depuis 8 ans, je conçois des interfaces UX intuitives, naturelles et fluides sur différents appareils. Ce qui me passionne, c'est de créer des expériences numériques qui sont non seulement esthétiques, mais aussi parfaitement fonctionnelles, rendant chaque interaction plus fluide et agréable."
                        },

                        "zh": {
                            "description": "我做 UX 设计已经 8 年了，专注于打造直观、自然且在不同设备上都流畅的用户界面。我热衷于设计既美观又高效的数字体验，让交互变得更加顺畅和愉悦。"
                        }
                    }
                },

                {
                    "id": 2,
                    "locales": {
                        "en": {
                            "description": "I believe that good design should enhance people's lives, helping them navigate technology with ease and confidence. Let’s work together to bring ideas to life and build something truly amazing!"
                        },

                        "es": {
                            "description": "Creo que un buen diseño debe mejorar la vida de las personas, ayudándolas a interactuar con la tecnología de manera fácil y segura. ¡Trabajemos juntos para dar vida a nuevas ideas y crear algo increíble!"
                        },

                        "fr": {
                            "description": "Je suis convaincu qu’un bon design doit améliorer la vie des gens en leur permettant d’utiliser la technologie avec facilité et confiance. Travaillons ensemble pour donner vie à de nouvelles idées et créer quelque chose d’exceptionnel !"
                        },

                        "zh": {
                            "description": "我坚信优秀的设计应该提升人们的生活，让他们能够轻松、自信地使用科技。无论是网站、应用还是复杂系统，我都致力于打造能真正与用户产生深层连接的产品。让我们携手合作，将想法变为现实，创造非凡的作品！"
                        }
                    }
                }
            ]
        }
    ]
}