{
    "articles": [
        {
            "id": 1,
            "component": "ArticleProfile",
            "locales": {},
            "settings": {
                "order_items_by": "id",
                "order_items_sort": "asc",
                "contact_list_ids": ["address", "email", "phone"],
                "contact_circles_ids": ["instagram", "facebook", "linkedin", "github"]
            },
            "items": [
                {
                    "id": 1,
                    "locales": {
                        "en": {
                            "description": "I've been a UX designer for <strong>8 years</strong>, crafting user-friendly interfaces that feel natural, intuitive, and seamless across different devices. My passion lies in designing digital experiences that not only look great but also function effortlessly, making interactions smoother and more enjoyable."
                        },

                        "es": {
                            "description": "Soy diseñador UX desde hace <strong>8 años</strong>, creando interfaces amigables que se sienten naturales, intuitivas y fluidas en diferentes dispositivos. Me apasiona diseñar experiencias digitales que no solo se vean bien, sino que también funcionen sin esfuerzo, haciendo que las interacciones sean más suaves y agradables."
                        },

                        "fr": {
                            "description": "Je suis designer UX depuis <strong>8 ans</strong>, créant des interfaces conviviales qui se sentent naturelles, intuitives et fluides sur différents appareils. Ma passion est de concevoir des expériences numériques qui non seulement sont esthétiques, mais fonctionnent également sans effort, rendant les interactions plus fluides et agréables."
                        },

                        "zh": {
                            "description": "我是一名拥有<strong>8年</strong>经验的UX设计师，专注于打造自然、直观且跨设备无缝的用户界面。我的热情在于设计数字体验，不仅外观出色，而且功能流畅，使交互更加顺畅和愉悦。"
                        }
                    }
                },

                {
                    "id": 2,
                    "locales": {
                        "en": {
                            "description": "I believe that good design should enhance people's lives, helping them navigate technology with ease and confidence. Let’s work together to bring ideas to life and build something truly amazing!"
                        },

                        "es": {
                            "description": "Creo que un buen diseño debe mejorar la vida de las personas, ayudándolas a navegar por la tecnología con facilidad y confianza. ¡Trabajemos juntos para dar vida a las ideas y construir algo verdaderamente asombroso!"
                        },

                        "fr": {
                            "description": "Je crois qu'un bon design doit améliorer la vie des gens, les aidant à naviguer dans la technologie avec aisance et confiance. Travaillons ensemble pour donner vie aux idées et construire quelque chose de vraiment incroyable !"
                        },

                        "zh": {
                            "description": "我相信好的设计应该提升人们的生活，帮助他们轻松自信地使用技术。让我们一起工作，将创意变为现实，打造真正令人惊叹的作品！"
                        }
                    }
                }
            ]
        }
    ]
}