{
    "locales": {
        "en": {
            "title": "<span class='text-primary'>Professional</span> Experience",
            "description": "A look into my work experience and career journey."
        },

        "es": {
            "title": "<span class='text-primary'>Experiencia</span> Profesional",
            "description": "Un vistazo a mi experiencia laboral y trayectoria profesional."
        },

        "fr": {
            "title": "Expérience <span class='text-primary'>Professionnelle</span>",
            "description": "Un aperçu de mon expérience professionnelle et de mon parcours de carrière."
        },

        "zh": {
            "title": "<span class='text-primary'>专业</span> 经验",
            "description": "了解我的工作经验和职业之旅。"
        }
    },

    "items": [
        {
            "id": "experience_item_1",
            "place": "@link{places.uxStudio}",
            "period": ["2015/01", "2017/12"],
            "locales": {
                "en": {
                    "title": "UX Designer",
                    "description": "Contributed to designing intuitive and user-friendly web application interfaces, creating engaging and seamless user experiences. Collaborated closely with cross-functional teams and stakeholders to ensure designs aligned with business goals and user needs.",
                    "tags": ["Figma", "Wireframing", "Prototyping", "Responsive Design", "User Research"]
                },
                "es": {
                    "title": "Diseñador de UX",
                    "description": "Contribuí al diseño de interfaces de aplicaciones web intuitivas y amigables para el usuario, creando experiencias de usuario atractivas y fluidas. Colaboré estrechamente con equipos multifuncionales e interesados para asegurarme de que los diseños se alinearan con los objetivos comerciales y las necesidades de los usuarios.",
                    "tags": ["Figma", "Prototipado", "Diseño Responsivo", "Investigación de Usuarios", "Wireframing"]
                },
                "fr": {
                    "title": "Designer UX",
                    "description": "Contribué à la conception d'interfaces d'applications web intuitives et conviviales, créant ainsi des expériences utilisateur engageantes et fluides. Collaboré étroitement avec des équipes pluridisciplinaires et des parties prenantes pour garantir que les designs soient alignés sur les objectifs commerciaux et les besoins des utilisateurs.",
                    "tags": ["Figma", "Maquettes", "Prototypage", "Design Responsive", "Recherche Utilisateur"]
                },
                "zh": {
                    "title": "用户体验设计师",
                    "description": "为设计直观、用户友好的网络应用界面作出了贡献，创建了引人入胜且无缝的用户体验。与跨职能团队和利益相关者密切合作，确保设计与业务目标和用户需求相一致。",
                    "tags": ["Figma", "线框图", "原型设计", "响应式设计", "用户研究"]
                }
            }
        },

        {
            "id": "experience_item_2",
            "place": "@link{places.adobe}",
            "period": ["2018/01", "2020/08"],
            "locales": {
                "en": {
                    "title": "Senior UI/UX Designer",
                    "description": "Led design projects, conducted comprehensive user research, and utilized data-driven insights to enhance user experiences. Managed design teams, fostering creativity and innovation while implementing design best practices to deliver successful outcomes for various digital products.",
                    "tags": ["Figma", "Adobe XD", "Sketch", "Data-Driven Design"]
                },
                "es": {
                    "title": "Designer Senior UI/UX",
                    "description": "Lideré proyectos de diseño, realicé investigaciones exhaustivas sobre usuarios y utilicé información basada en datos para mejorar las experiencias de usuario. Gestioné equipos de diseño, fomentando la creatividad y la innovación al tiempo que implementaba las mejores prácticas de diseño para obtener resultados exitosos en diversos productos digitales.",
                    "tags": ["Figma", "Adobe XD", "Sketch", "Diseño Basado en Datos"]
                },
                "fr": {
                    "title": "Designer UI/UX Senior",
                    "description": "A piloté les initiatives UX en supervisant une équipe de concepteurs, en élaborant des stratégies de conception et en dirigeant des collaborations interfonctionnelles avec les responsables de produits, les ingénieurs et les cadres. Axé sur la création de designs centrés sur l'utilisateur alignés sur les objectifs commerciaux et aboutissant à une satisfaction accrue des utilisateurs.",
                    "tags": ["Figma", "Adobe XD", "Sketch", "Conception Basée sur les Données"]
                },
                "zh": {
                    "title": "高级UI/UX设计师",
                    "description": "领导设计项目，进行全面的用户研究，利用数据驱动的见解提升用户体验。管理设计团队，培养创意和创新，同时实施设计最佳实践，为各种数字产品交付成功的结果。",
                    "tags": ["Figma", "Adobe XD", "Sketch", "数据驱动设计"]
                }
            }
        },

        {
            "id": "experience_item_3",
            "place": "@link{places.apple}",
            "period": ["2020/09", "2022/09"],
            "locales": {
                "en": {
                    "title": "Lead UX Designer",
                    "description": "Drove UX initiatives by overseeing a team of designers, crafting design strategies, and spearheading cross-functional collaborations with product managers, engineers, and executives. Focused on creating user-centric designs that aligned with business objectives and resulted in enhanced user satisfaction.",
                    "tags": ["Sketch", "Adobe XD", "InVision", "Design Strategy", "Cross-Functional Collaboration"]
                },
                "es": {
                    "title": "Designer UX Principal",
                    "description": "Impulsé iniciativas de UX supervisando un equipo de diseñadores, elaborando estrategias de diseño y liderando colaboraciones multifuncionales con gerentes de producto, ingenieros y ejecutivos. Centrado en crear diseños centrados en el usuario que se alinearan con los objetivos comerciales y que dieron como resultado una mayor satisfacción del usuario.",
                    "tags": ["Sketch", "Adobe XD", "InVision", "Estrategia de Diseño", "Colaboración Multifuncional"]
                },
                "fr": {
                    "title": "Designer UX Principal",
                    "description": "A piloté les initiatives UX en supervisant une équipe de concepteurs, en élaborant des stratégies de conception et en dirigeant des collaborations interfonctionnelles avec les responsables de produits, les ingénieurs et les cadres. Axé sur la création de designs centrés sur l'utilisateur alignés sur les objectifs commerciaux et aboutissant à une satisfaction accrue des utilisateurs.",
                    "tags": ["Sketch", "Adobe XD", "InVision", "Stratégie de Conception", "Collaboration Interfonctionnelle"]
                },
                "zh": {
                    "title": "首席用户体验设计师",
                    "description": "通过监督设计团队、制定设计战略，并与产品经理、工程师和高管共同推动跨职能合作，推动了用户体验的创新。专注于创建符合业务目标的以用户为中心的设计，从而实现了增强的用户满意度。",
                    "tags": ["Sketch", "Adobe XD", "InVision", "设计战略", "跨职能合作"]
                }
            }
        },

        {
            "id": "experience_item_4",
            "place": "@link{places.coursera}",
            "period": ["2022/10", "now"],
            "locales": {
                "en": {
                    "title": "UX Design Full-Time Professor",
                    "description": "Leveraged my expertise in UX design to educate and inspire students in the art of user-centered design principles. Conducted user studies, analyzed data, and guided students in applying theoretical knowledge to practical projects, empowering the next generation of UX designers.",
                    "tags": ["Adobe XD", "Sketch", "Axure", "Educational Mentorship"]
                },
                "es": {
                    "title": "Profesor de Tiempo Completo en UX Design",
                    "description": "Utilicé mi experiencia en diseño UX para educar e inspirar a los estudiantes en el arte de los principios de diseño centrado en el usuario. Realicé estudios de usuarios, analicé datos y orienté a los estudiantes en la aplicación de conocimientos teóricos a proyectos prácticos, empoderando a la próxima generación de diseñadores UX.",
                    "tags": ["Adobe XD", "Sketch", "Axure", "Mentoría Educativa"]
                },
                "fr": {
                    "title": "Professeur à temps plein en UX Design",
                    "description": "J'ai mis à profit mon expertise en conception UX pour éduquer et inspirer les étudiants dans l'art des principes de conception centrés sur l'utilisateur. J'ai réalisé des études utilisateur, analysé des données et guidé les étudiants dans l'application des connaissances théoriques à des projets pratiques, donnant ainsi les moyens à la prochaine génération de concepteurs UX.",
                    "tags": ["Adobe XD", "Sketch", "Axure", "Mentorat Éducatif"]
                },
                "zh": {
                    "title": "全职用户体验设计教授",
                    "description": "利用我的用户体验设计专业知识，教育和激励学生学习以用户为中心的设计原则。进行用户研究，分析数据，并指导学生将理论知识应用于实际项目，培养下一代用户体验设计师。",
                    "tags": ["Adobe XD", "Sketch", "Axure", "教育指导"]
                }
            }
        }
    ]
}